In [1]:
import pandas as pd

In [2]:
data = {'Roll No':[1,2,3,4,5] ,
        'Name':['Khan Waqar','Adil Azad','Pratik Chand','Gaikar Rohit','Tejas Kadu'] ,
        'Marks':[78,70,79,78,75],
        'Address':['Seawoods','Khopoli','Kalamboli','Kamothe','Wadala'] }

In [3]:
df = pd.DataFrame(data)

In [4]:
df

   Roll No          Name  Marks    Address
0        1    Khan Waqar     78   Seawoods
1        2     Adil Azad     70    Khopoli
2        3  Pratik Chand     79  Kalamboli
3        4  Gaikar Rohit     78    Kamothe
4        5    Tejas Kadu     75     Wadala

In [5]:
df['Name'].str.split(' ' , expand=True)

        0      1
0    Khan  Waqar
1    Adil   Azad
2  Pratik  Chand
3  Gaikar  Rohit
4   Tejas   Kadu

In [6]:
df[['Sir Name' , 'First Name']] = df['Name'].str.split(' ' , expand=True)

In [7]:
df

   Roll No          Name  Marks    Address Sir Name First Name
0        1    Khan Waqar     78   Seawoods     Khan      Waqar
1        2     Adil Azad     70    Khopoli     Adil       Azad
2        3  Pratik Chand     79  Kalamboli   Pratik      Chand
3        4  Gaikar Rohit     78    Kamothe   Gaikar      Rohit
4        5    Tejas Kadu     75     Wadala    Tejas       Kadu

In [8]:
Email = ['KhanWaqar@phcet.com','AdilAzad@mes.com','PratikChand@phcet.com','GaikarRohit@mes.com','TejasKadu@phcet.com']

In [9]:
df['Email'] = Email

In [10]:
df

,Roll No,Name,Marks,Address,Sir Name,First Name,Email
0,1,Khan Waqar,78,Seawoods,Khan,Waqar,KhanWaqar@phcet.com
1,2,Adil Azad,70,Khopoli,Adil,Azad,AdilAzad@mes.com
2,3,Pratik Chand,79,Kalamboli,Pratik,Chand,PratikChand@phcet.com
3,4,Gaikar Rohit,78,Kamothe,Gaikar,Rohit,GaikarRohit@mes.com
4,5,Tejas Kadu,75,Wadala,Tejas,Kadu,TejasKadu@phcet.com

In [11]:
filt = (df['Name']=='Khan Waqar')

In [12]:
df.loc[filt,'Email']

0    KhanWaqar@phcet.com
Name: Email, dtype: object